films
adapted
comic
books
plenty
success
whether
superheroes
batman
superman
spawn
geared
toward
kids
casper
arthouse
crowd
ghost
world
theres
never
really
book
like
starters
was
created
alan
moore
eddie
campbell
brought
medium
whole
new
level
mid
80s
12part
series
called
watchmen
say
thoroughly
researched
subject
jack
ripper
saying
michael
jackson
starting
look
little
odd
graphic
novel
will
over
500
pages
long
includes
nearly
30
consist
nothing
footnotes
other
words
dismiss
film
source
you
can
get
past
thing
might
find
another
stumbling
block
hells
directors
albert
allen
hughes
getting
brothers
direct
seems
almost
ludicrous
casting
carrot
top
well
anything
riddle
this
better
set
ghetto
features
violent
street
crime
mad
geniuses
behind
menace
ii
society
question
course
whitechapel
1888
londons
east
end
filthy
sooty
place
whores
unfortunates
nervous
mysterious
psychopath
carving
their
profession
surgical
precision
first
stiff
turns
copper
peter
godley
robbie
coltrane
not
enough
calls
inspector
frederick
abberline
johnny
depp
blow
crack
case
widower
has
prophetic
dreams
unsuccessfully
tries
quell
copious
amounts
absinthe
opium
upon
arriving
befriends
unfortunate
named
mary
kelly
heather
graham
isnt
proceeds
investigate
horribly
gruesome
crimes
that
even
police
surgeon
stomach
think
anyone
needs
be
briefed
go
particulars
a
unique
interesting
theory
identity
killer
reasons
chooses
slay
bother
cloaking
screenwriters
terry
hayes
vertical
limit
rafael
yglesias
les
mis
rables
good
job
keeping
hidden
viewers
funny
watch
locals
blindly
point
the
finger
blame
jews
indians
after
an
englishman
capable
committing
ghastly
acts
ending
whistling
stonecutters
song
from
simpsons
days
holds
back
electric
carwho
made
steve
guttenberg
star
dont
worry
itll
make
sense
see
now
onto
appearance
certainly
dark
bleak
its
surprising
much
looks
tim
burton
planet
of
apes
times
it
sleepy
hollow
2
print
saw
completely
finished
both
color
music
had
finalized
no
comments
about
marilyn
manson
cinematographer
deming
word
ably
captures
dreariness
victorianera
london
helped
flashy
killing
scenes
remind
me
crazy
flashbacks
twin
peaks
though
violence
pales
comparison
to
blackandwhite
oscar
winner
martin
childs
shakespeare
love
production
design
original
prague
surroundings
one
creepy
acting
hell
solid
dreamy
turning
typically
strong
performance
deftly
handling
british
accent
ians
holm
joe
goulds
secret
richardson
102
dalmatians
log
great
supporting
roles
big
surprise
is
i
cringed
time
opened
mouth
imagining
attempt
at
irish
actually
half
bad
however
all
00
r
for
violencegore
sexuality
language
and
drug
content
every
movie
comes
along
suspect
studio
indication
stinker
everybodys
perhaps
becomes
critical
darling
mtv
election
high
school
comedy
starring
matthew
broderick
reese
witherspoon
current
example
anybody
know
existed
week
plot
deceptively
simple
george
washington
carver
student
elections
tracy
flick
overachiever
her
hand
raised
way
mr
m
sick
megalomaniac
encourages
paul
popularbutslow
jock
run
pauls
nihilistic
sister
jumps
race
personal
side
such
sleeper
expectations
low
going
fact
quality
stuff
reviews
enthusiastic
any
right
cant
help
baggage
glowing
contrast
negative
reviewers
likely
live
hype
makes
disappointing
contains
significant
details
lifted
directly
rushmore
released
few
months
earlier
similarities
staggering
president
extraordinary
number
clubs
involved
play
max
fischer
with
tension
potential
relationship
teacher
his
most
single
parent
home
contributed
drive
male
bumbling
adult
pursues
extramarital
affair
gets
caught
life
ruined
bee
sting
bill
murray
several
stings
what
happened
individual
screenplay
contain
many
points
yet
probably
aware
each
two
different
studios
genre
geeks
revenge
hadnt
fully
formed
so
strengths
rely
fantastic
performances
newcomer
jessica
antisocial
tammy
playing
rooney
role
ferris
bueller
he
having
fun
since
revelation
early
year
teenagers
have
clout
money
deserves
nomination
once
campbells
character
speech
gymnasium
then
youre
won
been
bothering
seen
there
amount
suppose
coming
should
expect
less
starts
light
airy
sitcom
screws
tighten
tensions
mount
alexander
payne
decides
add
elements
frankly
distract
story
tracys
determination
win
costs
did
they
throw
studentteacher
logical
reason
lot
tonal
nosedive
takes
explicitly
sexdriven
mark
as
disappointment
got
mail
works
alot
order
cast
extremely
popular
attractive
stars
them
share
screen
hours
collect
profits
real
inventive
bone
body
basically
complete
reshoot
shop
around
corner
adding
modern
twists
essentially
goes
defies
concepts
contemporary
filmmaking
overly
sentimental
terribly
mushy
mention
manipulative
oh
enjoyable
manipulation
must
something
than
work
absolutely
hated
previous
ryanhanks
teaming
sleepless
seattle
couldnt
directing
helmed
woman
havent
quite
figured
liked
youve
important
again
storyline
cliched
come
tom
hanks
plays
fox
insanely
likeable
owner
discount
chain
meg
ryan
kathleen
kelley
proprietor
familyrun
childrens
nice
homage
soon
become
bitter
rivals
store
opening
across
small
business
are
already
internet
neither
party
knows
persons
true
rest
because
serve
mere
backdrop
sure
mildly
subplots
fail
utter
cuteness
main
leads
predictable
climax
but
foreseeable
damn
cute
welldone
doubt
in
entire
scene
evokes
pure
joy
part
does
when
discovers
online
filled
lack
happiness
left
theater
smiling
jaws
rare
grabs
attention
shows
image
opens
blackness
distant
alienlike
underwater
sounds
ominous
bars
composer
john
williams
infamous
score
dahdum
director
steven
spielberg
wastes
taking
us
water
midnight
swim
beautiful
girl
deadly
away
lets
vulnerable
floating
ocean
attacked
relinquishes
grip
outstanding
builds
theatrical
act
second
unlike
filmmakers
deal
restraint
refuses
show
shark
middle
merely
suggests
presence
subjective
shots
building
bit
sharks
arrival
truly
terrifying
let
bored
imagery
chief
brody
roy
scheider
york
cop
taken
easy
peaceful
running
station
amity
island
fictitious
england
resort
town
murder
gun
fired
25
years
shaken
vicious
white
attacks
fourth
july
mayor
larry
vaughn
hamilton
doesnt
want
shut
beaches
reliant
summer
tourist
joined
matt
hooper
richard
dreyfuss
young
ambitious
expert
marine
institute
fascinated
determined
stop
knowledge
exact
workings
perfect
engine
eating
machine
finally
relents
join
crusty
old
quint
robert
shaw
decrepit
boat
orca
search
three
men
hunt
inevitably
hunted
thriller
keen
humor
incredible
pacing
horror
ten
movies
rolled
wonder
took
america
storm
1975
crown
box
office
champ
unceremoniously
dethroned
1977
wars
today
fascination
par
hitchcocks
psycho
age
although
grand
technology
exists
technical
sequences
including
mechanical
obsolete
none
improve
would
lead
overkill
limitations
faced
may
produced
forced
traditional
cinematic
characterization
sharp
editing
creative
photography
instead
simply
dousing
audience
digital
effects
known
actors
draw
redford
newman
nevertheless
guaranteed
successful
careers
gave
refused
overshadowed
hits
just
notes
sympathetic
husband
father
political
quagmire
doing
your
warns
previously
american
graffiti
1973
apprenticeship
duddy
kravitz
1974
gives
surprisingly
mature
complex
someone
literally
only
played
gnarled
captain
ahab
sorely
overlooked
academy
awards
bordering
parody
grizzled
loner
whose
machismo
borders
masochism
slightly
deranged
shaws
caricature
late
below
deck
comparing
scars
drawn
telling
experiences
aboard
u
s
indianapolis
navy
ship
war
sunk
japanese
tale
1
000
swarms
slowly
devoured
more
hairraising
put
on
delivers
take
best
leave
black
eyes
endless
rows
teeth
insatiable
urge
eat
epitome
mankinds
fears
unknown
threatening
nature
nemesis
survived
sinch
dinosaurs
whites
exist
large
threat
spielbergs
feel
queasy
how
bunch
writihing
dangling
unprotected
legs
ready
chomped
combination
actual
footage
five
nicknamed
bruce
by
crew
built
shot
angles
forgotten
sort
precursor
waterworld
1995
soggy
cost
overruns
universal
worried
bomb
we
overcame
obstacles
delivered
finest
primal
scarethrillers
ever
hollywood
moviemaking
general
manager
nfl
team
postsalary
cap
era
allocate
resources
dollar
spent
freeagent
defensive
tackle
spend
linebackers
safeties
centers
teams
detroit
lions
boast
superstar
huge
contract
field
guys
herb
him
specialeffects
budget
hire
recognizable
jackie
chan
barry
sanders
spins
darts
cutting
line
watching
operation
condor
drives
motorcycle
crowded
streets
madrid
fleeing
armada
pursuers
identical
compact
cars
reminiscent
daylight
chicago
bears
hot
pursuit
except
rescuing
runaway
baby
carriages
cent
invested
stunts
pay
hospital
bills
leaves
75
cents
things
directs
scripts
dubbing
characters
hideous
title
sequence
also
explains
places
morocco
spain
chans
release
country
rumble
bronx
supposedly
filmed
vancouver
chase
canadian
rockies
clearly
visible
heck
haircut
hairstylist
same
always
mixture
lee
master
kungfu
slapstickfu
sent
un
retrieve
cache
lost
nazi
gold
north
african
desert
chased
horde
neonazi
sympathizers
stereotypical
arabs
correctness
women
do
scream
save
misuse
firearms
villain
broken
base
carried
everywhere
hes
pathetic
evil
en
route
extended
hilarious
fight
moroccan
version
motel
6
neonazis
confrontations
savage
natives
chopsocky
followed
centerpiece
windtunnel
faceoff
wellchoreographed
giant
kevlar
hamster
balls
smashedup
crates
bananas
scorpions
ignore
gaping
holes
exactly
villains
escape
why
key
values
hitchhiking
sahara
pretentions
being
raiders
ark
knockoff
wonders
franchise
blocking
lawrence
kazdan
lucas
producing
special
talent
mainstream
could
ought
utilize
june
1960
selftaught
idealistic
pragmatic
man
became
36
head
government
newly
independent
state
formerly
belgian
congo
later
ousted
powerful
position
troops
captured
brutally
murdered
aides
littleknown
meteoric
rise
fall
told
international
filmmaker
raoul
peck
lumumba
patrice
lumumbas
eriq
ebouaney
helmer
1991
award
winning
documentary
death
prophet
virtually
guaranteeing
fictional
account
patriot
remains
cowriter
pascal
bonitzer
begins
leader
perform
task
dismembering
bodies
images
hatchets
saws
fastemptying
whiskey
bottles
accompany
grisly
jump
meeting
among
leaders
belgianowned
third
class
postal
worker
speaks
mind
heads
tribes
proclaiming
tribal
regional
national
mobile
congolese
movement
mnc
gaining
prominence
clerical
sell
beer
face
bustling
capital
stanleyville
colonial
empires
falling
through
savvy
chesslike
achieves
leadership
date
independence
approaches
tactically
positions
nations
prime
minister
defense
presidency
joseph
kasa
vubu
maka
kotto
coalition
apart
former
masters
continue
exert
influence
struggling
nation
strive
maintain
economic
hold
countrys
vast
natural
diamonds
seek
knowing
try
create
de
facto
control
fledgling
initial
investigation
soviet
assistance
immediately
tags
communist
integrity
cold
russian
domination
situation
worse
army
mutinies
remaining
begin
evacuate
arm
violently
intervene
lucrative
katanga
province
succeeds
rival
moise
tschombe
nzonzi
access
returns
conference
abroad
tumultuous
period
history
sometimesodious
colonialists
ruled
european
seats
power
centuries
focuses
familiar
material
strives
give
honest
portrayal
friend
foes
movements
gripped
africa
50s
60s
nigeria
somalia
born
varying
degrees
failure
usually
dependent
colonized
some
others
effort
camera
bring
slice
gone
unexplored
decades
rate
standards
realistic
settings
nicely
maintained
traveled
zimbabwe
mozambique
covers
ground
yeomans
providing
detailed
trying
justice
evenly
linear
straightforward
manner
teaches
preaches
concentrates
deeds
stalwart
saint
embellish
larger
persona
family
patrices
handled
perfunctory
brief
interludes
talking
children
embracing
wife
lamenting
child
intent
flesh
short
shrift
given
lopsided
marks
actor
convincing
charismatic
multifaceted
politically
deft
people
force
driving
own
ambitions
docudrama
tradition
outshine
complementing
efforts
educational
appeal
buffs
politicos
intelligence
b
apparently
tony
kaye
major
battle
regarding
x
happy
final
product
removed
name
credits
altogether
heard
kind
happening
input
produce
found
kayes
focused
touchy
racism
edward
norton
hard
believe
nortons
fear
here
making
those
performers
derek
vinyard
skinhead
living
venice
beach
brother
danny
furlong
mother
beverly
dangelo
davin
jennifer
lien
flashback
which
kills
vandalizing
car
lands
prison
presenttime
eager
follow
footsteps
path
dereks
adoption
supremacy
served
finds
fullblown
understand
stupid
thoughtless
intelligent
articulate
voice
beliefs
disturbingly
terms
controversial
preach
note
redemption
phase
our
partially
disagree
advocate
presents
loud
obnoxious
smart
believable
arbitrarily
killed
group
clear
passionate
punk
looking
excuse
beat
helps
talented
astonishing
frightening
shaved
swastika
chest
addition
requires
depth
shouting
ease
meanest
likable
thats
gutsy
approach
adds
subplot
principal
dannys
avery
brooks
obsessed
purging
hatred
terrific
standouts
visually
very
indulges
artistic
choices
lots
slowmotion
strange
moody
atmosphere
lately
skims
greatness
last
minutes
climactic
moving
picture
ends
pretentious
preachy
resolution
featuring
narration
subtle
until
felt
slap
handfed
theme
simplistic
disliked
problem
imagine
least
pleased
timid
weak
manages
compelling
argument
without
advocating
my
colleagues
surprised
willing
betsys
wedding
shocked
hear
reaction
understandable
consider
revolves
molly
ringwald
hasnt
worthwhile
1986
alda
while
duds
four
noteworthy
projects
misdemeanors
written
directed
vibrant
sliceoflife
mixing
dramatic
moments
bowl
whimsical
aldas
elixir
smooth
refreshingand
welcome
change
pace
usual
fare
bride
groom
dylan
walsh
pivotal
far
nonentity
door
knob
unbearable
easily
weakest
link
she
shortcropped
orange
hair
red
lipstick
grotesque
outfits
supposed
dress
designer
clown
matters
ringwalds
matches
thankfully
keeps
minimum
interested
colorful
periphery
device
together
brides
workingclass
italian
grooms
rich
gentile
folks
homey
downtoearth
freespirited
madeline
kahn
practical
ally
sheedy
lonely
walshs
clan
prim
proper
ostentatious
families
meet
mingle
culture
clash
puts
versus
wonderfully
understated
pleasant
surprises
expresses
anthony
lapaglia
seizes
spotlight
stevie
dee
suave
polite
mafioso
formally
courting
oldfashioned
chivalry
lapaglias
sincere
dimwitted
riot
whats
uncanny
dead
ringer
niro
alec
baldwin
thrown
measure
attended
gangster
inspired
partly
tribute
rolemodel
ripoff
reborn
overthetop
missed
scrumptious
extends
beyond
pesci
particular
sinks
unscrupulous
brotherinlaw
slum
lord
mob
ties
cheating
catherine
ohara
challenge
somehow
touch
financiallystrapped
carpenter
bigger
wallet
adopts
psychological
view
plan
style
remarkably
restrained
tasteful
genius
woody
possess
inspiration
entertaining
slop
passes
bloody
clashes
pander
belgians
continued
condescending
paternalistic
officers
particularly
janssens
rudi
delhem
publique
congos
caused
rebellions
undermining
outraged
rape
nationals
unrest
tshombe
contained
70
percent
proclaimed
secession
replaced
mobutu
colonel
went
pacification
tour
too
drown
dog
rabies
prophesies
fate
exemplary
complicated
myriad
players
frequently
succumb
cliche
private
pecks
script
illuminates
bantu
sayings
rules
uses
ambassador
direction
assured
unfortunately
standard
television
dynamic
radiating
fierce
passion
ability
strategize
cornered
insurmountable
odds
elevate
mediocre
ebouaneys
tragedy
personally
action
drowning
sea
asian
wirefu
copycats
pretty
leaving
likes
schwartznager
stallone
van
damme
wearing
cement
galoshes
bottom
kung
fu
sometimes
mix
results
mindblowing
spectacle
amazing
exciting
stunt
1999s
matrix
gem
often
wrong
chinese
flying
ninjas
karate
soaring
detectives
slow
motion
kicking
scientists
mostly
laughable
hollywoods
rush
emulate
trademark
choreography
joke
art
form
iron
monkey
latest
import
reissue
1993
19th
vigilante
rongguang
yu
fighting
shaolin
rights
oppressed
bellies
hungry
piece
narrative
legendary
hero
wong
feihong
recently
possibly
2000
drunken
legend
younger
szeman
tsang
keiying
yen
chi
dan
thrust
monkeys
oppression
styles
especially
devolve
ridiculous
twinkletoed
crouching
tiger
dragon
yuen
wo
ping
eventually
remembers
earth
heart
hardcore
rather
drama
la
profoundness
shared
pass
outlaw
goodhearted
misguided
enemy
transcend
mindless
hearts
minds
equal
masterpiece
dances
invading
tune
aka
siunin
feihung
tsi
titmalau
rat
noticed
cheeks
sore
realized
laughing
aloud
held
grin
112
saturday
night
sneak
preview
damned
enjoy
goofy
delight
dandy
energetic
sight
gags
flatout
silliness
hands
zippy
retrostyle
were
torn
straight
slapstick
animated
photos
attached
herkyjerky
bounding
setup
donald
sinclair
cleese
venetian
hotel
casino
las
vegas
enjoys
concocting
unusual
bets
rolling
clients
dozen
tokens
slot
machines
gathering
lucky
token
holders
chance
game
six
competition
contestant
locker
silver
city
n
containing
million
cash
transmitter
cronies
keep
track
ahead
whichever
reaches
spoil
jokes
use
next
paragraphs
profile
racers
decked
trashy
clothing
sporting
vera
baker
whoopi
goldberg
reunite
daughter
grownup
merrill
lanai
chapman
erudite
conservative
wary
stranger
competitive
owen
templeton
cuba
gooding
jr
currently
referee
gamblers
enormous
blowing
call
highprofile
escaping
vengeful
cab
driver
mexico
masquerading
busload
lucy
ricardo
impersonators
heading
convention
pollini
rowan
atkinson
cheerful
holiday
narcoleptic
falls
asleep
inopportune
hitches
ride
zack
wayne
knight
hypertense
ambulance
carrying
human
transplant
randy
pear
jon
lovitz
promised
kathy
najimy
funfilled
vacation
fearful
angry
involvement
claims
travel
interview
insists
stay
hop
minivan
tear
duane
seth
green
blaine
vince
vieluf
cody
crooked
impediment
due
poorly
selfdone
tongue
piercing
person
close
understanding
boys
reach
goal
nick
shaffer
breckin
meyer
nononsense
lawyerintraining
who
recruits
helicopter
pilot
faucet
amy
journey
glance
seem
blandly
wholesome
changes
buzzes
boyfriend
shawn
dean
cain
spies
swimming
jerry
zucker
airplane
leaps
racer
periodically
returning
grisham
dave
thomas
personalityimpaired
cooking
bizarre
flat
momentum
zooms
missteps
include
involving
bates
roadside
squirrel
salesperson
intricately
gag
carries
museum
outdoor
rally
utterly
tasteless
screamingly
payoff
ditched
dropped
into
babys
clothes
cleavage
dozing
matron
laugh
squirminducing
hint
molestation
selected
band
concert
god
need
smash
performing
carping
noholdsbarred
diverse
dvd
buy
surely
outtakes
die

ive
thought
before
pseudo
substance
faking
deep
meanings
enjoyed
realize
missing
putting
rehearsed
melodramatic
evoke
connotations
if
step
aside
reflect
experience
discover
elegantly
presented
fluff
angels
somewhere
faltered
underneath
seemingly
poetic
beauty
gigantic
hole
somebody
covered
iridescent
glossy
cinematography
shattered
hopes
added
hour
worth
nicolas
cage
guardian
angel
hundreds
thousands
millions
spends
eternity
citizens
mortality
humans
celestial
intervention
occurs
subdued
maggie
doctor
ponder
alive
losing
patient
surgery
table
questions
envelope
oversee
patients
transition
afterlife
captivated
following
observing
everyday
quickly
learn
sensations
taste
desire
seths
adoration
resist
appear
regularly
taboo
angelic
community
interestingly
dressed
hitmen
entities
uniqueness
versatile
raising
arizona
happen
combo
slips
heavenly
agent
threatens
sappiness
pick
courage
fire
comparable
deviate
intelligently
ditzy
romantic
impressive
goers
rarely
dennis
franz
interpretation
meets
eye
shame
falters
stages
realization
emotionally
out
struggle
impacting
conclusion
wind
painful
thud
exhilarating
impression
linger
remember
convey
thru
60
glorious
disheartening
mediocrity
mouths
based
german
wings
english
ninety
forgive
shortcomings
devastatingly
noncynics
anyway
wrapped
surreal
criticism
criticized
nonetheless
beautifully
captivating
satisfy
appreciate
delve
emotional
territories
synopsis
bobby
garfield
yelchin
lives
mirthless
widowed
hope
davis
bobbys
friends
spritely
carol
boorem
day
boarder
arrives
house
ted
brautigan
hopkins
enigmatic
immediate
liking
bond
deepens
privy
teds
event
forever
review
enchanting
atlantis
recalls
kinginspired
comingofage
stand
setting
sentiment
conveys
magic
childhood
summers
neverending
means
closest
supernatural
element
prominent
characterdriven
benefits
greatly
superb
finding
innocence
resignation
splendid
still
whom
praised
highly
came
spider
radiant
despite
quiet
introspective
commands
onscreen
strident
elizabeth
cartoonish
carols
sully
sets
framing
paid
hicks
lovely
cloying
incident
ceases
weave
spell
todays
attempts
spice
1800s
courtroom
prisoner
cinque
djimon
hounsou
sierra
leone
kidnapped
slavery
fellow
prisoners
landed
shores
spanish
slave
traders
americans
speak
cinques
hauled
court
determine
legally
slaves
technically
trade
outlawed
considered
lawyers
adams
mcconaughey
prove
free
lengthy
cases
portrayed
panache
beginning
facial
closeups
anticlimax
subtitles
various
opinion
easier
fiction
invents
purposeful
clearcut
conflict
consists
stretches
boredom
thoughts
events
resolved
spicy
historically
accurate
turn
excellent
negotiator
entirely
unenviable
zero
attempting
talk
dangerous
criminal
whatever
intends
stake
armed
mentally
unstable
prone
notice
therefore
psychologist
sham
artist
officer
able
feet
either
confrontation
failing
prepared
facilitate
crisis
firepower
enter
scenario
possible
gain
dominate
conversation
perpetrator
thinking
wants
hostageholding
tricks
favor
circumstance
forms
basis
f
gary
grays
roman
samuel
l
tipped
partner
corruption
within
internal
affairs
incriminating
evidence
romans
embezzling
disability
fund
scorn
department
under
scrutiny
media
badge
typical
captains
said
hate
wouldnt
luckily
shakes
conventionalism
premise
mentioned
offered
takeitorleaveit
district
attorney
resolves
walking
niebaum
j
t
hostage
framed
actions
compressed
motivational
buildup
gray
redeems
negotiations
chris
sabian
kevin
spacey
ensue
miscast
identified
protagonist
notable
exceptions
brown
difficult
believing
carry
threats
guy
shoot
matter
tried
kill
preconception
saps
wouldbe
suspenseful
largely
attributed
jacksons
steals
appears
negotiating
hopelessly
sears
tower
bedroom
or
phone
says
gears
negotiate
swat
commander
david
morse
itching
send
fbi
agents
waiting
pressures
reflected
measures
up
lucked
beck
ron
rifkin
frost
spencer
al
travis
competent
typecasting
these
similar
rock
d
confidential
detective
land
forgiven
giamatti
rudy
hostages
relief
provides
initially
slimy
shifty
fortunately
seriousness
breathers
sustain
throughout
suspicious
clocks
sadly
underrated
passed
february
pleasantville
appeared
dozens
morning
vietnam
backdraft
nixon
check
sling
blade
mental
sharing
ward
billy
bob
thornton
nicholson
accepted
march
credited
performed
dedicated
characterizes
type
famous
plotline
parallels
reality
equally
negotiators
battling
resolve
suit
wed
provide
entertainment
loves
heavy
metal
steel
devoted
sings
launched
stardom
rid
singer
critique
sucker
humble
background
lofty
devotes
energy
patience
ultimately
bigtime
boy
certain
luck
yup
types
equations
generally
tied
closely
entry
adaptation
roll
lifestyle
fills
preface
definitely
enhance
appreciation
teen
anymore
motley
crue
twisted
anthrax
cds
blast
listening
greater
standout
wahlberg
wow
fella
props
totally
geekgod
incidentally
ask
regular
goals
ethic
fulfill
aniston
girlfriend
romance
angle
sweet
pull
impressed
musicians
zakk
wylde
ozzy
osbourne
jeff
pilson
dokken
stephan
jenkins
blind
blas
elias
slaughter
dominic
west
kirk
cuddy
biggest
members
reallife
used
sing
judas
priest
cover
admitted
gay
record
recommending
originality
uplifting
wellpaced
central
showing
yeah
dig
heavier
soundtrack
rocks
joblo
810
boogie
nights
910
girlfight
610
goodfellas
1010
carryon
1972
regulars
sid
james
gang
crooks
stealing
contraceptive
pills
local
maternity
selling
off
profit
kenneth
sir
bernard
hypochondriac
hattie
jacques
retakes
charles
hawtrey
psychiatrist
dr
goode
fast
laughs
humorous
antics
visiting
sworn
secrecy
assure
ear
thinks
sex
cameos
joan
sims
expectant
weeks
overdue
constantly
connor
railway
cyril
son
cope
where
nurse
nurses
room
ball
barbara
windsor
sees
attempted
robbery
hospitals
panic
ensuing
quieter
matrons
forget
scarce
steal
windsors
full
effect
flounder
appealing
genuinely
ultimate
match
untouchables
deeper
examined
rivalry
1959
exaggeration
fits
perfectly
memorable
clever
prohibition
mobsters
led
ruthless
capone
underground
market
liquor
demanding
public
elliot
ness
impossible
peace
learns
stabilize
bend
laws
apparent
deniro
declaring
firm
believer
transfers
capones
bombs
restaurant
innocent
hesitation
lying
bastard
palma
towards
developed
introduced
duration
admiration
formation
overcoats
hats
walk
unison
forward
observed
feared
holding
guns
pistols
criminals
vigilantes
influenced
future
neo
morpheus
trinity
virtual
futuristic
1930s
between
countless
hippest
bravest
heroes
ones
member
characteristics
separated
ingenuity
costner
grows
unfair
develops
law
realizes
trusted
lose
stability
adversaries
anger
thunderous
longer
sean
connery
malone
aging
mentor
attack
knife
wit
needed
andy
garcia
wonderful
stone
becoming
teach
valuable
lessons
taught
smith
income
tax
offense
choreographed
intense
westernlike
train
steps
executed
ingeniously
excitement
pounding
drum
beats
rhythm
effective
excessively
glorified
blend
baseball
bat
stuck
seeing
vivid
roger
rabbit
10
remembering
besides
decided
rent
struck
brilliant
milestone
animation
combine
cartoon
interact
convincingly
comedymystery
somewhat
herman
1947
trouble
hardboiled
valiant
hoskins
k
maroon
tilvern
rogers
jessicas
unfaithfulness
cause
distraction
tells
reshoots
patty
cake
marvin
acme
stubby
toontown
destroyed
follows
judge
doom
christopher
lloyd
judgejuryand
executioner
discovered
toon
4
achievement
creation
frame
drew
zemekis
praise
overseeing
included
animators
costars
according
database
studied
imaginary
guess
scared
yourself
ppppplease
ben
stiller
choice
circulation
lay
claim
acerbic
neighbors
talkative
sexuallyfrustrated
coach
jerri
permanent
heroinaddicted
writer
stahl
industry
pushes
bankable
drugaddiction
pictures
minute
proved
commercially
ewan
mcgregor
springs
emma
brassed
received
respect
renton
boyles
transatlantic
junkfest
trainspotting
philosophy
em
seriously
drugs
mideighties
5
000aweek
churning
plotlines
disposable
tv
sitcoms
heroin
habit
stahls
size
utah
contributes
commanding
ways
chronicling
highs
lows
abuse
concept
addiction
maintenance
earliest
observations
casual
reference
naked
lunch
author
william
burroughs
asked
shoots
responds
shave
puncturing
veins
thrill
occasionally
wobbles
writing
autobiography
veloz
controlled
pointed
moved
toagain
authors
entered
convenient
marriage
exec
hurley
impossibly
swear
profanity
dubbed
conceived
random
hirings
firings
narrates
lover
kitty
norristowns
maria
bello
rehab
janeane
garofalo
wastedand
miscastas
heavilybespectacled
fails
hooks
dopedup
wordsmith
jaded
clinic
counselor
unshaven
mascara
stumble
wreck
credit
pillpopping
needlejabbing
ubiquitous
strangely
absorbing
study
assisted
phil
curtolo
mel
gibson
braveheart
gripping
howards
ransom
mullen
wealthy
tycoon
haunt
sinise
forrest
gump
lowlife
thugs
kidnap
kate
rene
russo
tin
cup
instructed
inform
contacted
elite
delroy
lindo
arrow
toms
wiring
average
halfway
suddenly
news
broadcast
am
offering
reward
thickened
unusually
start
turned
suspensefilled
done
collide
wits
cellular
phones
gleiberman
weekly
commented
kidnappers
cell
mice
apollo
13
devilish
copgonebad
oscarworthy
observe
trek
serious
science
purpose
stories
exception
amazed
faces
enterprises
numerous
missions
insurrection
gotten
mine
worst
im
engaged
episode
cheesy
boring
feature
strictly
generation
introduces
baku
hundred
radiation
rings
fountain
youth
archenemies
sona
ruafo
abraham
mess
everything
disfigured
daily
reconstructive
aesthetically
acceptable
strike
federation
move
elsewhere
exploit
dying
picard
patrick
stewart
donna
murphy
trusty
habitat
dealing
necessary
reintroduce
nonfans
aspects
bold
magnetic
jonathan
frakes
riker
data
brent
spiner
discovering
fairly
overacting
showed
aptitude
contact
computer
result
pleasing
employ
space
suck
clean
impressively
complaint
moral
stance
appropriate
wanted
600
coexisted
feels
spring
kinds
inherent
camp
factor
wellequipped
issues
prefer
loaded
website
ace
ventura
truman
burbank
jim
carrey
gamut
1996s
cable
breakthrough
zany
darker
everyone
lessthanstellar
panned
critics
gene
siskel
admit
dug
theatres
super
criticmode
hbo
lean
relax
grew
stalked
break
stevens
problems
robin
leslie
mann
creeping
aliases
tate
chip
douglas
ricky
etc
didnt
newer
lessmanic
karaoke
jam
apartment
medieval
bathroom
beating
liar
carreys
during
jefferson
airplanes
sung
aformentioned
spots
focus
fooled
moment
contrived
dissapointing
venture
video
suggest
wait
till
bulworth
ended
allowed
sigh
satire
recent
wag
instance
heartless
primary
colors
unwatchable
awfulness
execution
lasting
tremendously
center
writerdirectorstar
warren
beatty
allows
identify
care
incumbent
democratic
senator
jay
billington
sobbing
watches
slept
eaten
instantaneously
insane
stark
raving
outright
bonkers
weekend
campaign
assistant
oliver
platt
feed
church
mean
lady
asks
shouts
obvious
propelled
muses
decisions
suicidal
sunglasses
beckel
believes
hitman
nina
halle
berry
infatuated
span
bulworths
truth
politics
methods
sensation
polls
appearing
spewing
coherent
sentences
beattys
sides
reached
lashing
screwing
structure
parties
affiliations
antirich
sentiments
tiresome
segments
rap
luncheon
absurd
core
package
accessible
feeling
recognition
higher
scale
dialogue
hugely
noticeable
luminous
repertoire
don
cheadle
dealer
guntoting
toddlers
dirty
careful
someday
induce
intensity
sorvino
southern
list
mastered
inflections
offensive
wasnt
offended
hardly
blindsided
honesty
eclectic
dance
minor
quibbles
otherwise
uproariously
proves
scratch
surface
911
window
soul
working
command
gaze
ralph
fiennes
morgan
freeman
tell
beings
tupac
shakur
gridlockd
oddly
gritty
social
costar
roth
sketchy
chemistry
ezekiel
spoon
whitmore
stretch
rome
buddies
spoken
wordjazz
trio
cookie
thandie
newton
eve
comatose
overdose
borrowed
temptation
fix
hindrance
hitting
road
bureaucracy
confusion
tape
suspects
nasty
thug
vondie
curtis
hall
accept
odyssey
urban
realism
unless
sleep
bringing
offices
thankful
response
fatuous
commentary
1991s
besieged
venting
righteous
system
inner
los
angeles
dfens
personalized
license
plate
echoed
drepers
plates
whips
breakfast
mcdonalds
unarmed
demands
placed
unhinged
heroic
surrogate
audiences
writerdirector
hook
bureaucrat
tirade
picked
frustrating
cathartic
yield
answers
chunk
stretchs
flight
dreper
scares
chummy
chestnut
mistakenlysuspected
report
designed
standing
sitting
gratuitous
inserts
paraphernalia
wasting
selfdestructive
behavior
irony
career
idea
displays
survival
instinct
hardness
gangsta
conscience
appetite
gleeful
selfdestructiveness
reveals
hiv
positive
preparing
obstacle
spoons
agency
gridlockds
cruelly
helping
emergency
repeatedly
stabbing
tiny
pocket
symbol
company
drained
enemies
tired
wont
chances
ultralow
dropout
chronicles
convenience
slackers
brian
ohalloran
anderson
ignoring
customers
discussing
fellatio
selffulfillment
grainy
getout
reported
27
originally
rated
nc17
recommended
sensitive
ears
zoe
remake
reservoir
dogs
french
avarys
slowmoving
failed
bastille
bank
eric
stoltz
paris
robbers
safecracker
blissful
unaware
botch
intriguing
fronts
paced
speed
pulp
avary
cowrote
quentin
tarantino
wellville
coraghessan
boyle
bowels
explored
harvey
kellogg
bucktoothed
bespectacled
1900s
advocated
abstinence
vegetarianism
frequent
defecation
invented
cornflake
checkingin
kelloggs
creek
sanitarium
bridget
fonda
wellknown
laughter
marvel
unfunny
cusack
lerner
lara
flynn
neville
dana
carvey
impeccable
amusing
novelty
wears
parkers
darnedness
doodoo
phew
stargate
arabia
epic
scifi
sheer
else
roland
emmerich
solider
shamelessly
rips
cosmic
overlong
cardboard
fans
sculpted
sands
morphing
headdresses
spunky
spader
egyptologist
pyramids
kurt
russell
jaye
davidson
crying
fame
generations
forgiving
sluggish
mixed
bag
earnest
lacks
punch
latter
klingon
comeuppance
impact
enterprise
cut
shatner
plead
unremarkable
miracle
34th
season
specialist
et
maybe
santa
claus
mayfielddirected
tarnish
memory
mcdermott
perkins
attenborough
definitive
kriss
kringle
moisten
alarm
junior
arnold
schwarzenegger
pregnant
crystal
test
schwarz
bulging
belly
coup
dustin
hoffman
tootsie
onejoke
ivan
reitman
twins
wisely
farce
moves
slower
yuks
devito
arnie
collision
werent
1960s
monterey
pop
affords
affectionate
glimpse
parents
hippies
otis
redding
jimi
hendrix
janis
joplin
mamas
papas
jampacked
contagious
fair
warning
reveal
1969
precluded
woodstock
stereotype
population
painted
smoke
joints
pennebaker
moon
broadway
broad
spectrum
stir
cleaning
interviewer
replies
organized
craziness
phillips
organizers
dionne
warwick
tuning
remarks
decent
sound
vanity
twoway
interaction
performer
continues
infectious
belts
ballad
lyrics
wild
mime
guitar
singing
recognize
stage
enthralled
drawback
bands
names
approximately
7
wholly
forgettable
18
78
stimulating
precious
sway
variety
immersed
dispelled
depressing
nsync
backstreet
lopez
modeling
common
francis
ford
coppolas
godfather
glamorising
mafia
institution
guided
ancient
virtues
honour
loyalty
solidarity
suitable
gentler
kinder
ages
scorsese
italoamerican
moviemaker
confronted
perspective
vision
dealt
lower
echelons
organised
unspectacular
artsy
compete
portrayals
seventeen
returned
influential
1990s
owes
popularity
bestseller
wiseguy
nicholas
pileggi
cowrite
chronicled
thirty
henry
hill
ray
liotta
irishitalian
recruited
organisation
paulie
cicero
boss
gradually
climbs
ladder
errands
couple
tommy
vito
joins
thieves
jimmy
conway
associates
wealth
culminate
spectacular
robberies
privileges
connected
seduce
karen
lorraine
bracco
afterwards
remain
loyal
infidelities
domestic
arrests
accomplice
wiseguys
tommys
unpredictable
outbursts
homicidal
jimmys
reluctance
loot
partners
henrys
downfall
represents
glory
managed
contradictions
ripped
depicted
ordinary
fascinating
spares
hypocrisy
paranoia
seductive
exposed
notorious
understands
chose
paths
trading
superficial
shortlasting
glamour
prosperity
dullness
poverty
moralistic
inhibitions
revolting
depict
tragedies
homes
depravity
bloodshed
uncompromising
ironic
narrators
humour
skills
potentially
disturbing
talents
relatively
prologue
narrator
switches
switch
shortly
multiple
views
lengthens
distance
nostalgia
illustrated
easylistening
1950s
songs
depression
expression
neurotic
1970s
comment
pastoral
tunes
associated
continuos
rooms
interacting
require
skill
shootings
fragmentary
bases
loosely
vignettes
opportunity
experiment
experiments
segment
near
essential
collection
respectable
businesslike
deserved
lines
adlibs
represent
nominal
liottas
hollywoodised
glamorous
lowlevel
improves
menacing
descends
cesspool
patriarch
chuck
pestering
smalltime
unknowingly
digs
grave
sociological
innovative
rightful
blair
witch
project
merit
managing
scare
experienced
senses
sequel
inevitable
tourists
practically
invaded
burkettsville
mass
hysteria
twigsculptures
stones
dirt
exasperated
sheriff
patrols
woods
bullhorn
goddamned
sudden
advantage
attracts
leading
groups
strangers
stephen
tristen
kim
dresses
psychic
powers
erica
witchwannabe
quotes
wiccan
lore
rule
wicca
harm
threefold
plunges
argue
decide
amidst
ruins
parrs
abandoned
wake
equipment
tapes
markings
loops
uncontrollably
forth
haunted
hallucinations
horrible
nightmares
difference
berlinger
paradice
helms
creators
myrick
ed
sanches
scenesthe
townspeople
affected
promising
outside
confused
sidetracked
anticlimaxic
epilogue
worked
doomed
suspense
repeated
situations
quantity
artistical
gracefully
panes
bloodyred
forest
carter
burwells
malkovich
fargo
musical
handheld
videocameras
nfeatured
improvisation
aspect
perfection
creating
graceful
polished
associate
installment
adrenaline
obviously
misunderstood
predecessor
simplicity
incredibly
fill
gaps
imagination
empty
projected
entir
e
shadows
restrict
satisfied
resorts
fancy
succeed
importantly
stands
connection
allow
destroy
scary
cross
constant
jeffrey
donovan
tristine
skyler
surrealism
seemed
completed
limits
commercial
3
31
1999
rented
analyze
secondary
issue
committed
philosophizing
theorizing
defines
poignant
beautifullyconstructed
roleplaying
ja
v
wherein
player
gather
clues
figure
overcome
neogothic
runner
murdoch
sewell
hurried
chilling
alone
define
horrific
tone
nor
sympathize
feelings
morals
total
amnesia
tool
developing
mood
outlining
semblance
unfold
serial
met
frank
bumstead
hurt
unemotional
softspoken
deadpan
trail
daniel
p
schreber
sutherland
johns
connelly
jazz
dolled
caraciture
dick
serials
filmnoir
continually
revealed
contacts
further
continual
vertigo
significance
considering
intricate
detail
lighting
overall
afford
gratuities
reaching
maximum
continuing
wanders
hoax
conducted
aliens
tick
extinction
tagline
explained
possesses
telekinetic
conceive
process
bald
pasty
skin
masse
awake
coscreenwriter
alex
proyas
consistently
regard
explanations
synthesize
chemical
memories
citys
creates
thoughtprovoking
philosophies
applied
errs
intertwined
mystery
expected
emotions
static
crucial
genuine
inferring
fullest
ironically
crow
spirit
messenger
mistaken
message
notably
visual
accounts
linda
fiorentino
disappeared
radar
deservedly
heralded
pic
seduction
dogmas
inexplicable
fine
bethany
abortion
faith
visitor
heaven
fiery
entrance
bethanys
metatron
rickman
fallen
entering
jersey
churchthe
universe
depends
himherself
heshe
trip
garden
prophets
jason
mewes
silent
doubleduty
slacker
minstrels
smiths
thus
drops
sky
rufus
undocumented
thirteenth
apostle
offers
divine
stripper
serendipity
salma
hayek
loki
bartleby
damon
affleck
respectivelythis
sharpest
banished
wisconsin
dogmatic
loophole
enable
return
wreak
havoc
sins
absolved
pearly
gates
terrorizes
boardroom
suits
bullets
guiltily
corrupt
aint
debuting
clerks
grown
linkbetween
wooden
nofrills
changed
widescreen
compositions
blockbuster
affectations
writinghis
sit
delivering
caustic
dogma
chips
religious
issuesnamely
accompanies
beliefseloquently
articulately
monologues
blatant
exposition
verbal
introduction
weighty
maintaining
hurlyburly
slack
diatribe
laments
destiny
weve
lokis
rant
prior
bloated
videoage
sponge
samplemad
indie
pays
batch
indiana
jones
crusade
harrison
weird
sciencea
shit
demon
kitchen
sink
brand
dexterous
maneuvering
satirical
cardinal
carlin
publicity
slogan
catholicism
scatalogical
ensures
malnourished
bust
gut
occasions
proceedings
foot
funniest
disclaimer
unlikely
protestors
read
prerelease
ballyhoo
christs
scorseses
1988
nikos
kazantzakis
linked
rumours
heresy
anecdote
fletch
ritchie
inviting
picketers
christ
screening
dime
rallying
watched
jesus
shells
denouement
thrilling
showdown
catholic
lovein
veritable
recruitment
poster
religion
belong
devotion
spirituality
shines
editorial
league
doctrine
roundabout
attacking
freedom
celluloid
biblethumper
qualified
criticize
donohue
followers
natalie
portman
professional
queen
amidala
liam
neeson
schindlers
quigon
jinn
obiwan
kenobi
jake
jingle
anakin
skywalker
humanity
trilogy
kiddiefriendly
adults
stunning
digitalized
creatures
amazingly
lightsaber
duels
amidalas
sumptuous
robes
fit
worn
broadstroked
jedi
dignity
wise
anchor
fleshing
portmans
mcgregors
luke
leia
stoic
stilted
caricatured
vulcan
geisha
endearing
jinns
manfully
infuse
spark
insight
nails
guiness
scottish
profound
preexisting
fan
fanatic
brushup
obscure
nefarious
palpatine
steeped
trivia
emperor
hooded
apparition
darth
vaders
empire
strikes
phantom
meant
echoes
meaningful
r2d2
c3po
appearances
banking
fondness
jabba
hutt
corpulent
lazy
planets
foreshadowing
guest
tatooine
coruscant
cloud
alderaan
leias
blown
briefly
passing
tying
answer
meat
alien
distracted
looked
gila
monsters
barely
muppets
jar
binks
silly
rabbitish
amphibious
intended
annoying
chewbacca
youll
pardon
interactions
expensive
teenage
mutant
ninja
turtles
furthermore
corny
downright
infantile
thereby
rendering
bystanders
judgment
kinship
eightyearold
lloyds
fault
kid
mistake
tyke
vader
spoilers
anakins
blond
flowing
rosy
aggression
doting
pernilla
august
gross
gnome
roses
yodas
allowing
explanation
clouded
spoiler
risk
noble
dies
maul
scarylooking
sith
excels
arts
dude
establishes
doublesided
makeup
quigons
padawan
apprentice
knightdom
training
saga
jedisize
treated
pod
races
triumph
backgrounds
yoda
origins
simpler
happier
kasdan
lacking
vergil
tibbs
suspected
murderer
inside
jail
eyecatching
conducting
bigots
chosen
amazes
seconds
heat
norman
jewison
concerning
displaying
pedantic
analyses
abused
abusers
afraid
absolute
present
preceding
soldiers
hurricane
classic
1967
superbly
sidney
poitier
fearless
philadelphia
loses
temper
mentioning
facing
against
chains
patterns
range
stentorian
soothing
denzel
dominated
shares
rod
steiger
dangers
racist
refer
suspiciously
progresses
gradual
hardships
foolishness
steigers
abandon
connect
mister
settled
virgil
differently
reversing
influences
jewisons
south
united
states
interest
rushed
giving
credible
victim
fifteen
inane
sam
vigilant
homicide
discoveries
nowhere
answered
congratulations
scott
wilson
blood
aged
professor
livedin
naturalism
wall
variations
gordon
gecko
personified
mid80s
tended
exaggerate
vehemence
cutthroat
businessmen
frothing
projecting
intentions
tightly
goodnatured
veneer
orton
open
showy
truthful
embodies
grady
craggy
predilection
pot
pink
bathrobes
instructs
writers
workshop
tirelessly
map
encounter
curmudgeon
midst
sardonic
students
bombard
criticisms
jealousy
target
writerly
leer
tobey
maguire
mild
affection
mechanically
intellectualized
monotone
dry
edges
portentous
gloomy
depressed
calculated
reminds
selfimposed
outcast
jarmusch
whenever
catch
speaking
toneless
monotonous
drawl
masking
contempt
exclusively
spiked
dyed
snow
equates
quirks
round
sweeteerie
resembles
bud
cort
harold
maude
warm
messed
credibility
katie
holmes
hannah
gradys
pants
resemble
springer
documented
jealous
wish
throwing
lowly
critic
douglass
companion
breathtaking
zeta
kidnapping
shifted
reviewing
pontificating
chivalrously
resists
charms
sara
gaskell
droll
frances
mcdormand
married
okay
chivalrous
junkie
printed
manufactured
downy
bisexual
editor
towering
transvestite
gleefully
hyper
hipster
intellectual
arrogant
arrogance
joyous
hanksian
edgy
searching
pointless
meanders
charm
biased
haven
literary
academia
fond
cinema
subgenre
westerns
individuals
inclined
knock
above
grade
notch
hanson
akin
leisurely
grow
generic
mapped
quibble
introverted
lowkey
chuckleworthy
throwaway
altman
h
goodbye
asides
fringes
broader
incessant
smoking
marijuana
ineffective
toiled
exploitation
losin
cruise
cradle
graduated
appropriately
dour
false
gloom
morose
crooning
leonard
cohen
literature
equivalent
novelistic
themes
slight
savor
subtleties
zoolander
model
dumb
impressionable
secretly
hired
trained
fashion
syndicate
assassinate
malaysia
abolish
labor
deed
grace
comedies
pretend
idiotic
premises
ideal
frivolous
assembled
grant
cracked
loudly
specific
loved
unrestrained
whipping
snap
models
celebrity
zane
winona
ryder
christian
slater
duchovny
dicks
makeover
masseuse
bound
bulimia
orgy
christine
taylor
breakdance
countries
plots
zeroing
compared
pissed
gas
disaster
adored
walkoff
contest
bowie
appreciated
zoolanders
moronic
oneliners
merman
dare
photo
zipped
zagged
established
laughed
trailer
quips
skip
dodo
bird
austin
blue
710
deuce
bigalow
freddy
fingered
510
310
unzipped
portrait
isaac
mizrahi
palette
fabric
ostensibly
term
stretching
meaning
staged
cuttingandpasting
verite
conceit
spontaneity
premium
actresses
cindy
crawford
keeve
mizrahis
freely
admits
capturing
violating
legitimate
sheds
behindthescenes
incomplete
eminently
quotable
wanting
cows
tyler
kennedy
shaped
nowadays
draws
sources
nanook
bette
enlists
aid
ouija
board
traces
development
1994
inception
highlights
naomi
bush
evangelista
filming
stocks
8
16
mm
35
artiness
stock
serves
behindthe
treatment
expose
per
se
clips
petulant
viewer
tame
wear
viewed
declares
designing
liberating
constructed
dora
fernanda
montenegro
sits
makeshift
desk
rios
demeanor
service
unheard
writes
letters
illiterate
relatives
debts
quirky
elderly
caring
trustworthy
sends
saving
postage
relishing
therein
neighbor
irene
mar
lia
ra
nineyear
thereafter
hit
bus
orphaned
josu
roams
desperate
clueless
predictament
circumstances
elaborate
responsibility
security
rio
traveling
outskirts
brazil
unpaved
roads
devotees
povertystricken
commonplace
foreign
fresh
breath
entertainingly
heartwrenchingly
